{
"Scenarios":[
    {
      "id": 1,
      "prompt_text": "Your friend invites you to a late-night movie marathon on a weekday. Do you join for the social fun, or prioritize a good night's sleep for your health and school commitments the next day?",
      "choices": [
        {
          "preview": "Join the Movie Marathon",
          "choice_text": "Participate in the movie marathon for social enjoyment, but be mindful of setting a limit to ensure adequate sleep for health and school.",
          "change": [3, -2, -1]
        },
        {
          "preview": "Prioritize Sleep",
          "choice_text": "Opt to prioritize a good night's sleep to maintain overall health and be well-rested for school the next day, suggesting alternative plans for another time.",
          "change": [1, 2, 3]
        }
      ]
    },
    {
      "id": 2,
      "prompt_text": "Your classmate invites you to a study group the night before a major exam. Do you join for collaborative learning and social support, or study independently to maintain focus?",
      "choices": [
        {
          "preview": "Join Study Group",
          "choice_text": "Participate in the study group for collaborative learning and social support, but establish boundaries to ensure productive study time.",
          "change": [2, 2, -1]
        },
        {
          "preview": "Study Independently",
          "choice_text": "Choose to study independently to maintain focus and control over your study environment, ensuring efficient preparation for the exam.",
          "change": [-1, 3, 1]
        }
      ]
    },
    {
      "id": 3,
      "prompt_text": "Your parents want you to attend a family gathering during a crucial study weekend. Do you join for family bonding, or communicate the importance of your academic commitments and stay home to focus on studies?",
      "choices": [
        {
          "preview": "Attend Family Gathering",
          "choice_text": "Participate in the family gathering for bonding but communicate your study commitments, perhaps negotiating specific study times during the event.",
          "change": [2, -3, -2]
        },
        {
          "preview": "Prioritize Studies",
          "choice_text": "Choose to stay home and focus on studies, emphasizing the importance of academic commitments while expressing willingness to engage in family activities at a more suitable time.",
          "change": [-2, 3, 2]
        }
      ]
    },
    {
      "id": 4,
      "prompt_text": "Your friends plan a spontaneous road trip over the weekend. Do you join for the adventure and social experience, or decline to focus on your upcoming exams and prioritize your academic responsibilities?",
      "choices": [
        {
          "preview": "Join the Road Trip",
          "choice_text": "Embark on the road trip for a spontaneous adventure, but communicate the need for designated study breaks to balance socializing with academic commitments.",
          "change": [3, -2, -2]
        },
        {
          "preview": "Prioritize Exams",
          "choice_text": "Opt to decline the road trip to concentrate on exam preparation, emphasizing the importance of academic responsibilities and proposing alternative plans for after exams.",
          "change": [-1, 3, 2]
        }
      ]
    },
    {
      "id": 5,
      "prompt_text": "You're feeling overwhelmed with schoolwork and extracurricular activities. Do you ask for help or support from friends or family, or try to manage the stress on your own to avoid burdening others?",
      "choices": [
        {
          "preview": "Seek Support",
          "choice_text": "Reach out to friends or family for emotional support and assistance in managing workload, fostering a collaborative approach to cope with stress.",
          "change": [3, -2, -1]
        },
        {
          "preview": "Manage Stress Independently",
          "choice_text": "Choose to manage stress independently to avoid burdening others, but consider establishing healthier coping mechanisms and self-care routines.",
          "change": [-2, 2, 1]
        }
      ]
    },
    {
      "id": 6,
      "prompt_text": "Your school organizes a charity event, and they're looking for volunteers. Do you sign up to contribute to the community and gain social experiences, or decline to focus on personal activities and school commitments?",
      "choices": [
        {
          "preview": "Volunteer for Charity Event",
          "choice_text": "Sign up to volunteer for the charity event, contributing to the community and gaining valuable social experiences, while balancing commitments.",
          "change": [2, -1, -1]
        },
        {
          "preview": "Focus on Personal Activities",
          "choice_text": "Decline the volunteer opportunity to focus on personal activities and school commitments, ensuring a balance between community engagement and personal responsibilities.",
          "change": [-1, 1, 1]
        }
      ]
    },
    {
      "id": 7,
      "prompt_text": "Your friends invite you to a late-night gaming session. Do you join for the social fun, or prioritize a good night's sleep for your health and school commitments the next day?",
      "choices": [
        {
          "preview": "Join the Gaming Session",
          "choice_text": "Participate for social fun but set a time limit to ensure enough sleep for health and school.",
          "change": [2, -2, -1]
        },
        {
          "preview": "Prioritize Sleep",
          "choice_text": "Opt for a good night's sleep, ensuring you're well-rested for school, and suggest an alternative time for gaming.",
          "change": [1, 2, 2]
        }
      ]
    },
    {
      "id": 8,
      "prompt_text": "A classmate invites you to a party the night before a major project deadline. Do you attend for socializing, or stay home to focus on completing the project?",
      "choices": [
        {
          "preview": "Attend the Party",
          "choice_text": "Go to the party for socializing but communicate your project deadline and set a time to leave early to work on it.",
          "change": [3, -2, -2]
        },
        {
          "preview": "Focus on the Project",
          "choice_text": "Choose to stay home and prioritize completing the project, emphasizing its importance over social events.",
          "change": [-1, 3, 2]
        }
      ]
    },
    {
      "id": 9,
      "prompt_text": "Your school offers a yoga class during lunch break. Do you join for the health benefits and social interaction, or use the time to study for an upcoming exam?",
      "choices": [
        {
          "preview": "Join Yoga Class",
          "choice_text": "Participate in the yoga class for health benefits and social interaction, ensuring a balanced approach to well-being.",
          "change": [2, -1, 1]
        },
        {
          "preview": "Study During Lunch",
          "choice_text": "Opt to study during lunch to prepare for the exam, prioritizing academic commitments over physical activity and socializing.",
          "change": [-1, 2, -1]
        }
      ]
    },
    {
      "id": 10,
      "prompt_text": "You're invited to a networking event that aligns with your career goals, but it falls on the same day as a close friend's birthday party. Do you prioritize your professional development or celebrate with your friend?",
      "choices": [
        {
          "preview": "Attend Networking Event",
          "choice_text": "Attend the networking event to enhance professional opportunities, but communicate with your friend and plan a belated celebration.",
          "change": [3, -1, 0]
        },
        {
          "preview": "Celebrate Friend's Birthday",
          "choice_text": "Celebrate your friend's birthday, prioritizing personal connections, and express your commitment to professional growth on another occasion.",
          "change": [2, 0, -1]
        }
      ]
    },
    {
      "id": 11,
      "prompt_text": "You have the opportunity to travel abroad for a cultural exchange program during the semester, but it conflicts with an important internship opportunity. Do you choose international experience or prioritize gaining industry-specific skills?",
      "choices": [
        {
          "preview": "Join Cultural Exchange Program",
          "choice_text": "Opt for the cultural exchange program for diverse experiences, but explore possibilities to defer the internship or find alternative remote work.",
          "change": [4, -2, 1]
        },
        {
          "preview": "Prioritize Internship",
          "choice_text": "Prioritize the internship to gain industry-specific skills, expressing gratitude for the opportunity and exploring cultural experiences at a later time.",
          "change": [-1, 3, -1]
        }
      ]
    },
    {
      "id": 12,
      "prompt_text": "Your friend asks you to cover for them at work because they want to attend a family event. Do you agree to help out, or prioritize your own commitments and decline?",
      "choices": [
        {
          "preview": "Help Friend at Work",
          "choice_text": "Agree to cover for your friend, prioritizing friendship and offering support, but communicate any potential limitations or conditions.",
          "change": [2, -1, -1]
        },
        {
          "preview": "Prioritize Own Commitments",
          "choice_text": "Politely decline to cover for your friend, emphasizing your own commitments, and suggest alternative solutions if possible.",
          "change": [-1, 1, 0]
        }
      ]
    },
    {
      "id": 13,
      "prompt_text": "You find out about a scholarship opportunity that requires a significant time investment in community service. Do you pursue the scholarship for potential financial benefits, or focus on other activities aligned with your career goals?",
      "choices": [
        {
          "preview": "Pursue Scholarship Through Community Service",
          "choice_text": "Invest time in community service for the scholarship, balancing financial benefits with the potential for personal growth and contribution.",
          "change": [3, 0, 1]
        },
        {
          "preview": "Focus on Career-Aligned Activities",
          "choice_text": "Prioritize activities aligned with your career goals, considering alternative financial options and focusing on professional development.",
          "change": [1, 0, 0]
        }
      ]
    },
    {
      "id": 14,
      "prompt_text": "You have the chance to collaborate on a creative project with classmates over the weekend, but it conflicts with a family gathering. Do you prioritize the collaborative opportunity or family time?",
      "choices": [
        {
          "preview": "Collaborate on Creative Project",
          "choice_text": "Join your classmates for the creative project, emphasizing the importance of the opportunity and exploring ways to make up for missed family time.",
          "change": [2, -1, 0]
        },
        {
          "preview": "Prioritize Family Gathering",
          "choice_text": "Prioritize the family gathering, communicating the importance of family and seeking alternative times to collaborate with classmates.",
          "change": [1, 0, -1]
        }
      ]
    }
  
  ]
}

 